<?php

/*
|--------------------------------------------------------------------------
| Создание приложения
|--------------------------------------------------------------------------
|
| Первое, что мы сделаем, это создадим новый экземпляр приложения Laravel
| который служит «клеем» для всех компонентов Laravel и является
| IoC-контейнером для системы, связывающей все различные части.
|
*/

$app = new Illuminate\Foundation\Application(
    realpath(__DIR__ . '/../')
);

/*
|--------------------------------------------------------------------------
| Привязка важных интерфейсов
|--------------------------------------------------------------------------
|
| Далее нам нужно связать несколько важных интерфейсов в контейнере, чтобы
| чтобы мы могли разрешить их, когда потребуется. Контейнеры "Kernel" обслуживают
| входящие запросы к этому приложению из веб и CLI.
|
*/

$app->singleton(
    Illuminate\Contracts\Http\Kernel::class,
    App\Http\Kernel::class
);

$app->singleton(
    Illuminate\Contracts\Console\Kernel::class,
    App\Console\Kernel::class
);

$app->singleton(
    Illuminate\Contracts\Debug\ExceptionHandler::class,
    App\Exceptions\Handler::class
);

/*
|--------------------------------------------------------------------------
| Вернуть приложение
|--------------------------------------------------------------------------
|
| Этот скрипт возвращает экземпляр приложения. Экземпляр передается
| вызывающему скрипту, чтобы можно было отделить создание экземпляров
| от фактического выполнения приложения и отправки ответов.
|
*/
return $app;
