<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются во время аутентификации для различных
    | сообщений, которые необходимо отобразить пользователю. Можно свободно изменять
    | эти языковые строки в соответствии с требованиями приложения.
    |
    */

    'failed' => 'Эти учетные данные не соответствуют нашим записям.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, повторите попытку через :second секунды.',
    'login' => 'Авторизация',
    'logout' => 'Выход',
    'register' => 'Регистрация',
    'remember_me' => 'Запомнить меня',
    'forgotten_password' => 'Забыли пароль ?',
    'reset_password' => 'Сбросить пароль',
    'send_password_reset_link' => 'Отправить ссылку для сброса пароля',
    'logged_in' => 'Вы вошли в систему',
    'logged_in_provider' => 'Теперь вы вошли в систему с помощью :Provider.',
    'not_authorized' => 'Не авторизован.',

];
