<?php

return [
    'media' => 'Медиа',
    'create' => 'Добавить изображение',
    'created' => 'Изображение опубликовано',
    'updated' => 'Изображение обновлено',
    'deleted' => 'Изображение удалено',
    'download' => 'Скачать',
    'show' => 'Показать',
    'delete' => 'Удалить',
    'count' => ':count изображение|:count изображения',

    'attributes' => [
        'image' => 'Изображение',
        'avatar' => 'Фото профиля',
        'name' => 'Название',
        'posted_at' => 'Опубликовано в',
        'url' => 'URL',
    ],

];
