<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки пагинации
    |--------------------------------------------------------------------------
    |
    | Следующие строки языка используются библиотекой paginator для создания
    | простых ссылок пагинации. Их можно менять на любые
    | другие, чтобы настроить свои страницы в соответствии с требованиями вашего приложения.
    |
    */

    'previous' => '« Предыдущий',
    'next' => 'Следующий »',

];
