<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки сброса пароля
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки являются строками по умолчанию, которые подходят требованиям, 
    | указанным брокером паролей для неудачной попытки изменения пароля, например, 
    | для недействительного токена или недействительного нового пароля.
*/

    'password' => 'Пароли должны быть не менее восьми символов и соответствовать подтверждению.',
    'reset' => 'Ваш пароль был сброшен!',
    'sent' => 'Мы отправили вам ссылку для сброса пароля по электронной почте!',
    'token' => 'Этот токен сброса пароля недействителен.',
    'user' => "Мы не можем найти пользователя с таким адресом электронной почты.",

];
