<?php

return [
    'publish' => 'Публиковать',
    'posts' => 'Публикации',
    'delete' => 'Удалить',
    'delete_thumbnail' => 'Удалить картинку',
    'edit' => 'Редактировать',
    'last_posts' => 'Последние публикации',
    'create' => 'Создать публикацию',
    'created' => 'Публикация создана',
    'updated' => 'Публикация обновлена',
    'deleted' => 'Публикация удалена',
    'empty' => 'Тут еще нет публикация.',
    'new_posts' => 'новая публикация|новые публикации',
    'count' => ':count публикацию|:count публикации',
    'show' => 'Показать публикацию',
    'search' => 'Поиск ...',
    'search_results' => ':count количество найденных публикаций|:count количество найденных публикации',

    'attributes' => [
        'title' => 'Заголовок',
        'content' => 'Контент',
        'author' => 'Автор',
        'thumbnail' => 'Опубликовать фотографию',
        'posted_at' => 'Опубликовано в',
        'thumbnail' => 'Уменьшенное изображение',
    ],

    'placeholder' => [
        'title' => 'Ваш заголовок',
        'content' => 'Ваш контент',
        'thumbnail' => 'Выбрать уменьшенное изображение'
    ]
];
