<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Аутентификация по умолчанию
    |--------------------------------------------------------------------------
    |
    | Этот параметр управляет «защитой» аутентификации по умолчанию и сбросом пароля
    | для вашего приложения. Можно изменить эти параметры 
    | по мере необходимости, но для большинства приложений они подходят наилучшим образом.
    |
    */

    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

    /*
    |--------------------------------------------------------------------------
    | Authentication Guards
    |--------------------------------------------------------------------------
    |
    | Далее можно определить каждый механизм защиты аутентификации приложения.
    | По умолчанию уже определена конфигурация по умолчанию.
    | которая использует хранилище сеансов и пользовательский провайдер Eloquent.
    |
    | Все драйверы аутентификации имеют провайдера пользователей. Он определяет, как
    | пользователи извлекаются из базы данных или других хранилищ.
    | механизмы, используемые этим приложением для хранения данных пользователей.
    |
    | Поддерживается: « session»
    |
    */

    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Провайдеры пользователей
    |--------------------------------------------------------------------------
    |
    | Все драйверы аутентификации имеют провайдера пользователя. Он определяет, как
    | пользователи извлекаются из вашей базы данных или других хранилищ.
    | механизмов, используемых этим приложением для хранения данных пользователей.
    |
    | Если есть несколько таблиц или моделей пользователей, можно настроить несколько
    | источников, представляющих каждую модель/таблицу. Затем эти источники могут быть
    | назначены любым дополнительным механизмам защиты аутентификации, которые были определены.
    |
    | Поддерживаются: «database», «eloquent».
    |
    */

    'providers' => [
        'users' => [
            'driver' => 'eloquent',
            'model' => App\Models\User::class,
        ],

        // 'users' => [
        //     'driver' => 'database',
        //     'table' => 'users',
        // ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Сброс паролей
    |--------------------------------------------------------------------------
    |
    | Можно указать несколько конфигураций сброса пароля, если в приложении имеется более
    | одной таблицы или модели пользователей в приложении и необходимо иметь
    | отдельные настройки сброса пароля на основе конкретных типов пользователей.
    |
    | | Время действия - это количество минут, в течение которых каждый маркер сброса будет
    | считаться действительным. Эта функция безопасности позволяет сделать токены недолговечными, чтобы
    | у них было меньше времени, чтобы их можно было угадать. При необходимости можно изменить это значение.
    |
    | Настройка дросселя - это количество секунд, которое пользователь должен подождать, прежде чем
    | генерировать новые токены для сброса пароля. Это не позволяет пользователю
    | быстро генерировать очень большое количество токенов для сброса пароля.
    |
    */

    'passwords' => [
        'users' => [
            'provider' => 'users',
            'table' => 'password_resets',
            'expire' => 60,
            'throttle' => 60,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Таймаут подтверждения пароля
    |--------------------------------------------------------------------------
    |
    | Здесь можно задать количество секунд до того, как проверка пароля
    | закончится, и пользователю будет предложено повторно ввести пароль на экране
    | подтверждения пароля. По умолчанию тайм-аут длится три часа.
    |
    */

    'password_timeout' => 10800,

];
