<?php

use Illuminate\Support\Str;

return [

    /*
    |--------------------------------------------------------------------------
    | Хранилище кэша по умолчанию
    |--------------------------------------------------------------------------
    |
    | Эта опция управляет соединением кэша по умолчанию, которое будет использоваться при
    | использовании этой библиотеки кэширования. Это соединение используется, если другое
    | не указано явно при выполнении данной функции кэширования.
    |
    */

    'default' => env('CACHE_DRIVER', 'file'),

    /*
    |--------------------------------------------------------------------------
    | Хранилища кэша
    |--------------------------------------------------------------------------
    |
    | Здесь можно определить все «хранилища» кэша для приложения, а также
    | их драйверы. Можно даже определить несколько хранилищ для
    | одного и того же драйвера кэша, чтобы сгруппировать типы элементов, хранящихся в кэше.
    |
    | Поддерживаемые драйверы: «apc», «array», «database», «file»,
    | «memcached», «redis», «dynamodb», «octane», «null»
    |
    */

    'stores' => [

        'apc' => [
            'driver' => 'apc',
        ],

        'array' => [
            'driver' => 'array',
            'serialize' => false,
        ],

        'database' => [
            'driver' => 'database',
            'table' => 'cache',
            'connection' => null,
            'lock_connection' => null,
        ],

        'file' => [
            'driver' => 'file',
            'path' => storage_path('framework/cache/data'),
            'lock_path' => storage_path('framework/cache/data'),
        ],

        'memcached' => [
            'driver' => 'memcached',
            'persistent_id' => env('MEMCACHED_PERSISTENT_ID'),
            'sasl' => [
                env('MEMCACHED_USERNAME'),
                env('MEMCACHED_PASSWORD'),
            ],
            'options' => [
                // Memcached::OPT_CONNECT_TIMEOUT => 2000,
            ],
            'servers' => [
                [
                    'host' => env('MEMCACHED_HOST', '127.0.0.1'),
                    'port' => env('MEMCACHED_PORT', 11211),
                    'weight' => 100,
                ],
            ],
        ],

        // 'redis' => [
        //     'driver' => 'redis',
        //     'connection' => 'cache',
        //     'lock_connection' => 'default',
        // ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Ключевой префикс кэша
    |--------------------------------------------------------------------------
    |
    | При использовании кэша APC, базы данных, memcached, Redis или DynamoDB
    | могут быть и другие приложения, использующие тот же кэш. По этой причине
    | поэтому во избежание коллизий можно использовать префикс для каждого ключа кэша.
    |
    */

    'prefix' => env('CACHE_PREFIX', Str::slug(env('APP_NAME', 'my-site'), '_') . '_cache_'),

];
