<?php

use Illuminate\Support\Str;

return [

    /*
    |--------------------------------------------------------------------------
    | Название подключения к базе данных по умолчанию
    |--------------------------------------------------------------------------
    |
    | Здесь можно указать, какое из приведенных ниже подключений к базе данных вам нужно
    | использовать в качестве соединения по умолчанию для работы с базой данных.
    |
    */

    'default' => env('DB_CONNECTION', 'mysql'),

    /*
    |--------------------------------------------------------------------------
    | Подключения к базе данных
    |--------------------------------------------------------------------------
    | Вся работа с базами данных в Laravel осуществляется через средства PHP PDO
    | поэтому необходимо убедиться, что установлен драйвер для вашей конкретной базы данных
    |
    */

    'connections' => [
        
        'mysql' => [
            'driver' => 'mysql',
            'url' => env('DATABASE_URL'),
            'host' => env('DB_HOST', '127.0.0.1'),
            'port' => env('DB_PORT', '3306'),
            'database' => env('DB_DATABASE', 'forge'),
            'username' => env('DB_USERNAME', 'forge'),
            'password' => env('DB_PASSWORD', ''),
            'unix_socket' => env('DB_SOCKET', ''),
            'charset' => 'utf8mb4',
            'collation' => 'utf8mb4_unicode_ci',
            'prefix' => '',
            'prefix_indexes' => true,
            'strict' => true,
            'engine' => null,
            'options' => extension_loaded('pdo_mysql') ? array_filter([
                PDO::MYSQL_ATTR_SSL_CA => env('MYSQL_ATTR_SSL_CA'),
            ]) : [],
        ],

        'sqlite' => [
            'driver' => 'sqlite',
            'url' => env('DATABASE_URL'),
            'database' => env('DB_DATABASE', database_path('database.sqlite')),
            'prefix' => '',
            'foreign_key_constraints' => env('DB_FOREIGN_KEYS', false),
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Таблица репозиториев миграции
    |--------------------------------------------------------------------------
    |
    | В этой таблице хранятся данные о всех миграциях, которые уже были запущены для
    | вашего приложения. Используя эту информацию, можно определить, какие из 
    | миграций на диске еще не были запущены в базе данных.
    |
    */

    'migrations' => 'migrations',

];
