<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Диск с файловой системой по умолчанию
    |--------------------------------------------------------------------------
    |
    | Здесь можно указать диск с файловой системой по умолчанию, который будет использоваться
    | фреймворком. Локальный диск, а также различные облачные диски
    | для приложения.
    |
    */

    'default' => env('FILESYSTEM_DISK', 'local'),

    /*
    |--------------------------------------------------------------------------
    | Диски файловой системы
    |--------------------------------------------------------------------------
    |
    | Здесь можно настроить столько «дисков» файловой системы, сколько вы хотите, и вы
    | можете даже настроить несколько дисков с одним и тем же драйвером. По умолчанию
    | были установлены для каждого драйвера в качестве примера необходимых значений.
    |
    | Поддерживаемые драйверы: «local», «ftp», «sftp», «s3».
    |
    */

    'disks' => [

        'local' => [
            'driver' => 'local',
            'root' => storage_path('app'),
            'throw' => false,
        ],

        'public' => [
            'driver' => 'local',
            'root' => storage_path('app/public'),
            'url' => env('APP_URL') . '/storage',
            'visibility' => 'public',
            'throw' => false,
        ],

        'media' => [
            'driver' => 'local',
            'root' => public_path() . '/media',
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | Символические ссылки
    |--------------------------------------------------------------------------
    |
    | В этом разделе можно настроить символические ссылки, которые будут создаваться при выполнении команды
    | `storage:link` команды Artisan. Ключами массива должны быть
    | места расположения ссылок, а значения - их цели.
    |
    */

    'links' => [
        public_path('storage') => storage_path('app/public'),
    ],

];
