<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Почтовый агент по умолчанию
    |--------------------------------------------------------------------------
    |
    | Этот параметр управляет почтовиком по умолчанию, который используется для отправки всех сообщений электронной почты
    | отправляемых приложением электронной почты. Можно настроить альтернативные почтовые программы
    | и использоваться по мере необходимости; однако по умолчанию будет использоваться этот почтовый сервер.
    |
    */

    'default' => env('MAIL_MAILER', 'smtp'),

    /*
    |--------------------------------------------------------------------------
    | Конфигурации почтового сервера
    |--------------------------------------------------------------------------
    |
    | Здесь можно настроить все почтовые серверы, используемые приложением, а также
    | их соответствующие настройки. Несколько примеров уже были настроены с учетом
    | но вы можете добавить свои собственные, как того требует приложение.
    |
    | Laravel поддерживает различные почтовые «транспортные» драйверы, которые будут использоваться при
    | отправки электронного письма. Ниже вы сможете указать, какой из них вы используете для своих
    | почтовых отправителей. При необходимости можно добавить дополнительные почтовые драйверы.
    |
    | Поддерживаются: «smtp», «sendmail», «mailgun», «ses», «ses-v2»,
    | «postmark», «log», «array», «failover»
    |
    */

    'mailers' => [
        'smtp' => [
            'transport' => 'smtp',
            'url' => env('MAIL_URL'),
            'host' => env('MAIL_HOST', 'smtp.mailgun.org'),
            'port' => env('MAIL_PORT', 587),
            'encryption' => env('MAIL_ENCRYPTION', 'tls'),
            'username' => env('MAIL_USERNAME'),
            'password' => env('MAIL_PASSWORD'),
            'timeout' => null,
            'local_domain' => env('MAIL_EHLO_DOMAIN'),
        ],

        'ses' => [
            'transport' => 'ses',
        ],

        'mailgun' => [
            'transport' => 'mailgun',
            // 'client' => [
            //     'timeout' => 5,
            // ],
        ],

        'postmark' => [
            'transport' => 'postmark',
            // 'message_stream_id' => null,
            // 'client' => [
            //     'timeout' => 5,
            // ],
        ],

        'sendmail' => [
            'transport' => 'sendmail',
            'path' => env('MAIL_SENDMAIL_PATH', '/usr/sbin/sendmail -bs -i'),
        ],

        'log' => [
            'transport' => 'log',
            'channel' => env('MAIL_LOG_CHANNEL'),
        ],

        'array' => [
            'transport' => 'array',
        ],

        'failover' => [
            'transport' => 'failover',
            'mailers' => [
                'smtp',
                'log',
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Глобальный адрес «From»
    |--------------------------------------------------------------------------
    |
    | Можно предусмотреть, чтобы все сообщения электронной почты, отправляемые приложением, отправлялись с
    | с одного и того же адреса. Здесь можно указать имя и адрес, которые будут
    | использоваться глобально для всех электронных писем, отправляемых приложением.
    |
    */

    'from' => [
        'address' => env('MAIL_FROM_ADDRESS', 'hello@example.com'),
        'name' => env('MAIL_FROM_NAME', 'Example'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Настройки почты в формате Markdown
    |--------------------------------------------------------------------------
    |
    | Если используется рендеринг почты на основе Markdown, вы можете настроить свою
    | тему и пути к компонентам, что позволит настроить дизайн
    | электронных писем. Или можно просто придерживаться настроек Laravel по умолчанию
    |
    */

    'markdown' => [
        'theme' => 'default',

        'paths' => [
            resource_path('views/vendor/mail'),
        ],
    ],

];
