<?php

use Laravel\Sanctum\Sanctum;

return [

    /*
    |--------------------------------------------------------------------------
    | Stateful Domains
    |--------------------------------------------------------------------------
    |
    | Запросы от следующих доменов/хостов будут получать stateful API
    | куки аутентификации. Как правило, к ним относятся локальный
    | и производственные домены, которые получают доступ к API через фронтенд SPA.
    |
    */

    'stateful' => explode(',', env('SANCTUM_STATEFUL_DOMAINS', sprintf(
        '%s%s',
        'localhost,localhost:3000,127.0.0.1,127.0.0.1:8000,::1',
        Sanctum::currentApplicationUrlWithPort()
    ))),

    /*
    |--------------------------------------------------------------------------
    | Sanctum Guards
    |--------------------------------------------------------------------------
    |
    | Этот массив содержит защиты аутентификации, которые будут проверяться, когда
    | Sanctum пытается аутентифицировать запрос. Если ни один из этих механизмов
    | не сможет аутентифицировать запрос, Sanctum будет использовать токен носителя,
    | который присутствует во входящем запросе для аутентификации.
    |
    */

    'guard' => ['web'],

    /*
    |--------------------------------------------------------------------------
    | Минуты истечения срока действия
    |--------------------------------------------------------------------------
    |
    | Это значение контролирует количество минут, в течение которых выпущенный токен будет
    | считаться истекшим. Это значение отменяет любые значения, установленные в атрибуте токена
    | «expires_at», но на сторонние сессии не влияет.
    |
    */

    'expiration' => null,

    /*
    |--------------------------------------------------------------------------
    | Токен-префикс
    |--------------------------------------------------------------------------
    |
    | Sanctum может префиксировать новые токены, чтобы воспользоваться преимуществами многочисленных
    | инициатив по сканированию безопасности, поддерживаемых платформами с открытым исходным кодом
    | которые уведомляют разработчиков о фиксации токенов в репозиториях.
    |
    | См.: https://docs.github.com/en/code-security/secret-scanning/about-secret-scanning
    |
    */

    'token_prefix' => env('SANCTUM_TOKEN_PREFIX', ''),

    /*
    |--------------------------------------------------------------------------
    | Sanctum Middleware
    |--------------------------------------------------------------------------
    |
    | При аутентификации вашего стороннего SPA с Sanctum вам может понадобиться
    | настроить некоторые промежуточные программы, которые Sanctum использует при обработке
    | запроса. При необходимости вы можете изменить перечисленное ниже промежуточное ПО.
    |
    */

    'middleware' => [
        'authenticate_session' => Laravel\Sanctum\Http\Middleware\AuthenticateSession::class,
        'encrypt_cookies' => App\Http\Middleware\EncryptCookies::class,
        'verify_csrf_token' => App\Http\Middleware\VerifyCsrfToken::class,
    ],

];
